---
kind: type
id: T:Autodesk.Revit.DB.FilteredWorksetIterator
source: html/c80ff08f-7511-ebed-dc44-233d18ad8e87.htm
---
# Autodesk.Revit.DB.FilteredWorksetIterator

An iterator to a set of worksets filtered by the settings of a FilteredWorksetCollector.

## Syntax (C#)
```csharp
public class FilteredWorksetIterator : IEnumerator<Workset>
```